Tekla Open API Reference for Tekla Structures 2025
DPMPrinterAttributes.OutputFileName Property
 Output file name and path. Applicable in PDF printing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string OutputFileName { get; set; }
Public Property OutputFileName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
DPMPrinterAttributes Class
Tekla.Structures.Drawing Namespace